"""
给用户三次输入用户名和密码的机会，要求如下：‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬

1）如输入第一行输入用户名为‘Kate’,第二行输入密码为‘666666’，输出‘登录成功！’，退出程序；‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬‬

2）当一共有3次输入用户名或密码不正确输出“3次用户名或者密码均有误！退出程序。”。
"""
def user_login():
    n = 1
    while n <= 3:
        username = input("请输入用户名：")
        password = input("请输入密码：")
        if username == 'Kate' and password == '666666':
            print("登录成功")
            break
        else:
            if n == 3:
                print("3次用户名或者密码均有误！退出程序。")
            else:
                print("登录名或密码错误请重新输入")

        n += 1
if __name__ == '__main__':
    user_login()



